{
  "metadata": {
    "total_parameters": 1024,
    "total_size": 4096
  },
  "weight_map": {
    "model.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.q_conv1d.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.k_conv1d.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.v_conv1d.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.A_log": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.f_a_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.f_b_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.dt_bias": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.b_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.g_a_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.g_b_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.o_norm.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.0.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
    "model.layers.1.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.self_attn.q_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.self_attn.kv_a_proj_with_mqa.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.self_attn.kv_a_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.self_attn.kv_b_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.self_attn.o_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.gate.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.gate.e_score_correction_bias": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.shared_experts.gate_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.shared_experts.up_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.shared_experts.down_proj.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w1.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w2.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.0.w3.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w1.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w2.weight": "model-00002-of-00002.safetensors",
    "model.layers.1.block_sparse_moe.experts.1.w3.weight": "model-00002-of-00002.safetensors",
    "model.norm.weight": "model-00002-of-00002.safetensors",
    "lm_head.weight": "model-00002-of-00002.safetensors"
  }
}
